import { QuestionCardProps } from "src/components/common";

export const QUESTION_ANSWER_LIST: QuestionCardProps[] = [
  // {
  //   question: "한 팀에 최소/최대 몇명까지 참여할 수 있나요?",
  //   answer:
  //     "한 팀은 포지션(개발/디자인/기획) 상관 없이 최소 3명에서 최대 5명까지 구성할 수 있습니다.",
  // },
  // {
  //   question: "해커톤 진행 중 식사는 어떻게 제공되나요?",
  //   answer:
  //     "진행 중 식사는 당연히 제공되며 야식도 같이 제공될 예정입니다.   식사 메뉴는 해커톤 진행 중 안내될 예정입니다.",
  // },
  // {
  //   question: "외부 라이브러리 사용이 가능한가요?",
  //   answer: "프로젝트 완성에 있어서 큰 영향을 주는것이 아닌 이상 사용 가능합니다.",
  // },
  // {
  //   question: "Chat GPT와 Bard 같은 AI 사용이 가능한가요?",
  //   answer:
  //     "밤새 진행하며 자신만의 힘으로 완성한다는 해커톤의 본질로써 Chat GPT와 Bard 같은 코드를 제공해주는 서비스는 사용이 불가능합니다.",
  // },
  {
    question: "한 팀에 최소/최대 몇 명까지 참여할 수 있나요?",
    answer: "팀의 최소 구성 인원은 3명, 최대 인원은 4명까지 참여할 수 있어요",
  },
  {
    question: "한세톤 진행 중 식사는 어떻게 제공되나요?",
    answer:
      "진행 중 식사는 제공되며, 함께 야식도 제공될 예정이에요. 식사 메뉴는 한세톤 진행 중 별도 안내될 예정입니다",
  },
  {
    question: "Chat GPT와 Bard 같은 AI 사용이 가능한가요?",
    answer:
      "밤새 진행하며 스스로의 힘으로 완성한다는 취지의 해커톤으로서, AI 서비스는 이용할 수 없어요",
  },
  {
    question: "대회에 반입 할 수 없는 물건도 있나요?",
    answer:
      "외부 음식(과자, 젤리, 음료) 및 개인 물품 이외의 것은 반입할 수 없어요. 또한 주변 팀에 방해가 될 수 있다고 판단되는 물건도 반입할 수 없어요",
  },
  {
    question: "대회 도중 외출이 가능한가요?",
    answer: "특별한 사유로 인해 운영진 측에 양해를 구하지 않는 한, 외부 외출은 할 수 없어요",
  },
  {
    question: "한세톤 주제는 언제 공개되나요?",
    answer: "주제는 한세톤 당일 오리엔테이션 시간에 공개될 예정이에요",
  },
];
